pblfrnndmnr/control-bomba-isl1208-pic16-xc8/trunk/Control_BOMBA_RTC_ISL1208_V6.X/main.c
/******************************************************************************/
/* Files to Include                                                           */
/******************************************************************************/
// Real Time Clock & NVRAM
// Hardware isl1208 of Dallas Maxim
// With interface I2C

#if defined(__XC)
#include <xc.h>         /* XC8 General Include File */
#elif defined(HI_TECH_C)
#include <htc.h>        /* HiTech General Include File */
#endif

#include <stdint.h>        /* For uint8_t definition */
#include <stdbool.h>       /* For true/false definition */
#include <stdio.h>
#include "system.h"        /* System funct/params, like osc/peripheral config */
#include "user.h"          /* User funct/params, such as InitApp */
#include "Pulsadores.h"
#include "pwm.h"
#include "adcPic16.h"
#include <string.h>

/******************************************************************************/
/* User Global Variable Declaration                                           */
/******************************************************************************/

/* i.e. uint8_t <variable_name>; */

/******************************************************************************/
/* Main Program                                                               */
/******************************************************************************/

//#fuses HS,MCLR,NOWDT,NOPROTECT,NOPUT,NOBROWNOUT,NOPBADEN,NOLVP,NOCPD,NODEBUG,NOWRT,NOVREGEN
//#use delay(clock=20000000)
//#use rs232(baud=9600, xmit=PIN_C6, rcv=PIN_C7)


#define USE_INTERRUPTS 1

#include "_isl1208.h"
#include "HardI2C.h"
#include "usart1.h"
#include "LCDGeneric.h"
///////////////////////////////////////////////////////////////////////////////

void lee_y_transmite_date_and_time(void) {
    isl1208_get_date(&fecha.day, &fecha.month, &fecha.yr, &fecha.dow);
    isl1208_get_time(&horarioactual.hrs, &horarioactual.min, &horarioactual.sec);
}

void main() {
    TMR1IE = 0; //   disable_interrupts(int_timer1);
    RCIE = 0; //    disable_interrupts(int_rda);
    RBIE = 0;
    INTE = 0; //disable_interrupts(int_ext);
    ADCON1 = 0x06; //todos puertos digitales
    //setup_counters(RTCC_INTERNAL,RTCC_DIV_2);
    T0CS = 0; // TMR0 Clock Source Select bit: internal
    PSA = 0; //Prescaler is assigned to the Timer0 module
    OPTION_REGbits.PS = 0b101; //: Prescaler Rate Select bits 1/64
    //setup_timer_1(T1_INTERNAL | T1_DIV_BY_1);
    T1CON = 1;
    CCP1CONbits.CCP1M = 0;
    //configura_USART();
    setup_i2c(I2C_MASTER);


    TRISB = 0b00111111; //Configuro las entradas de las teclas y la entrada del reloj
    PORTB = 0;
    TRISC0 = 0; //Configuro el pin de activacion de la bomba como salida
    TRISD = 0x00;
    PORTD = 0;
    TRISE = 0b00000000;
    PORTE = 0;

    vInitLCD();
    static char * cadena;
    sprintf(cadenaamostrar, cadena_esp);
    sprintf(cadenaamostrar2, cadena_esp);
    vGotoxyLCD(1, 1);
    cadena = cadenaamostrar;
    while (*cadena != '\0')
        vLCD_Putc(*cadena++);
    vGotoxyLCD(1, 2);
    cadena = cadenaamostrar2;
    while (*cadena != '\0')
        vLCD_Putc(*cadena++);
    refrescadisplay = 0;
    __delay_ms(500);
    sprintf(cadenaamostrar, "Ini...");
    vGotoxyLCD(1, 1);
    cadena = cadenaamostrar;
    while (*cadena != '\0')
        vLCD_Putc(*cadena++);
    vGotoxyLCD(1, 2);
    cadena = cadenaamostrar2;
    while (*cadena != '\0')
        vLCD_Putc(*cadena++);
    refrescadisplay = 0;


    set_periodo_buzzer(); //configuro el pwm para una frecuencia de 3khz
    buzzer_on();
    __delay_ms(200);
    buzzer_off();
    __delay_ms(200);
    buzzer_on();
    __delay_ms(200);
    buzzer_off();
    //ext_int_edge(2,H_TO_L);
    INTEDG = 0;
    INTE = 1; // enable_interrupts(int_ext2);
    TMR0IE = 1;
    setADCChannel(MIDECORRIENTE);
    __delay_us(20);
    openADC();
    __delay_us(20);
    interruptADC_on();
    __delay_ms(500);



    if (ISL1208_ready()) {
        sprintf(cadenaamostrar, "RTC OK");
        vGotoxyLCD(1, 1);
        cadena = cadenaamostrar;
        while (*cadena != '\0')
            vLCD_Putc(*cadena++);

        __delay_ms(500);
        __delay_ms(500);
        __delay_ms(500);
    } else {
        sprintf(cadenaamostrar, "RTC ERRO");
        vGotoxyLCD(1, 1);
        cadena = cadenaamostrar;
        while (*cadena != '\0')
            vLCD_Putc(*cadena++);

        __delay_ms(500);
        __delay_ms(500);
        __delay_ms(500);

    };
    fecha.day = 1;
    fecha.month = 1;
    fecha.yr = 15;
    fecha.dow = 4;

    isl1208SR.Valor = 0x00;
    isl1208SR.Valor = ISL1208_Read_status();
    if (isl1208SR.RTCF) {//Si se reseteo el RTC, envio directamente a configurar la hora
        isl1208_init();
        menuactual = MENU_CONFIGURAHORARIO;

    } else {

        lee_y_transmite_date_and_time();

        /*TODO leer el valor de la alarma de encendido en algun lado cuando se cambia el
         valor de horarioenc pero no se guarda
         */
        isl1208_get_time_enc(&horarioenc.hrs, &horarioenc.min, &horarioenc.sec);
        isl1208_get_dow_enc(&fechaenc.dow);

        if (isl1208SR.ALM) {
            //TODO se activo la alarma cuando estaba apagado, procesar

        }
    }

    // <editor-fold defaultstate="collapsed" desc="Lectura de datos guardados en EEPROM">
    periodoencendido = eeprom_read(0);
    tiempoencendido = eeprom_read(1);
    usa_falla_de_corriente = eeprom_read(2);
    usa_nivel_bajo = eeprom_read(3);
    tiempofalla = eeprom_read(4);
    // </editor-fold>

    ADIF = 0;
    INTF = 0; // borro las banderas de interrupcion
    TMR0IF = 0;
    PEIE = 1;
    ei(); //enable_interrupts(global);

    while (1) {
        // <editor-fold defaultstate="collapsed" desc="Inicia Procesa los menú">

        ////////////////////////////////////////
        switch (menuactual) {
            case MENU_MUESTRAHORA:
            {
                horario = &horarioactual;
                //Se actualiza lo que se muestra en el display, solamente cuando hay cambios en lo que mostrar

                if (flanco) {
                    lee_y_transmite_date_and_time();
                    sprintf(cadenaamostrar, "%02d:%02d    ", horarioactual.hrs, horarioactual.min);
                    sprintf(cadenaamostrar2, cadena_esp);
                } else {
                    sprintf(cadenaamostrar, "%02d %02d    ", horarioactual.hrs, horarioactual.min);
                    sprintf(cadenaamostrar2, cadena_esp);
                }
                break;
            }
            case MENU_MUESTRAFECHA:
            {

                if (flanco) {
                    lee_y_transmite_date_and_time();
                    sprintf(cadenaamostrar, "%02d/%02d/%02d ", fecha.day, fecha.month, fecha.yr);
                    sprintf(cadenaamostrar2, cadena_esp);
                    strncpy(cadenaamostrar2, days_of_week[dia_de_la_semana(&fecha.day, &fecha.month, &fecha.yr)], 2);
                }


                break;
            }
            case MENU_CONFIGURAHORARIO:
            {

                if (flanco) {
                    sprintf(cadenaamostrar, "SET HORA ");
                    sprintf(cadenaamostrar2, cadena_esp);
                }

                break;
            }
            case SUBMENU_CONFIGURAHORA:
            {
                modificafecha = HORA;
                horario = &horarioactual;
                if (flanco || haycambio) {
                    sprintf(cadenaamostrar, "%02d:%02d    ", horarioactual.hrs, horarioactual.min);
                    sprintf(cadenaamostrar2, cadena_esp);
                    haycambio = 0;
                } else {
                    sprintf(cadenaamostrar, "  :%02d    ", horarioactual.min);
                    sprintf(cadenaamostrar2, cadena_esp);
                }
                bandera_graba_hora = 1;
                break;
            }
            case SUBMENU_CONFIGURAMINUTOS:
            {
                modificafecha = MINUTOS;
                horario = &horarioactual;
                if (flanco || haycambio) {
                    sprintf(cadenaamostrar, "%02d:%02d    ", horarioactual.hrs, horarioactual.min);
                    sprintf(cadenaamostrar2, cadena_esp);
                    haycambio = 0;
                } else {
                    sprintf(cadenaamostrar, "%02d:      ", horarioactual.hrs);
                    sprintf(cadenaamostrar2, cadena_esp);
                }
                bandera_graba_hora = 1;
                break;
            }
            case MENU_CONFIGURAFECHA:
            {

                if (flanco) {
                    sprintf(cadenaamostrar, "SET FECHA");
                    sprintf(cadenaamostrar2, cadena_esp);
                }
                break;
            }
            case SUBMENU_CONFIGURADIA:
            {
                modificafecha = DIA;

