pblfrnndmnr/control-bomba-isl1208-pic16-xc8/trunk/Control_BOMBA_RTC_ISL1208_V6.X/main.c
                if (flanco || haycambio) {
                    sprintf(cadenaamostrar, "%02d/%02d/%02d ", fecha.day, fecha.month, fecha.yr);
                    sprintf(cadenaamostrar2, days_of_week[dia_de_la_semana(&fecha.day, &fecha.month, &fecha.yr)]);
                    //sprintf(cadenaamostrar2, "             ");
                    haycambio = 0;
                } else {
                    sprintf(cadenaamostrar, "  /%02d/%02d ", fecha.month, fecha.yr);
                    sprintf(cadenaamostrar2, cadena_esp);
                }
                bandera_graba_fecha = 1;
                break;
            }
            case SUBMENU_CONFIGURAMES:
            {
                modificafecha = MES;

                if (flanco || haycambio) {
                    sprintf(cadenaamostrar, "%02d/%02d/%02d ", fecha.day, fecha.month, fecha.yr);
                    sprintf(cadenaamostrar2, days_of_week[dia_de_la_semana(&fecha.day, &fecha.month, &fecha.yr)]);
                    haycambio = 0;
                } else {
                    sprintf(cadenaamostrar, "%02d/  /%02d ", fecha.day, fecha.yr);
                    sprintf(cadenaamostrar2, cadena_esp);
                }
                bandera_graba_fecha = 1;
                break;
            }
            case SUBMENU_CONFIGURAANIO:
            {
                modificafecha = ANIO;

                if (flanco || haycambio) {
                    sprintf(cadenaamostrar, "%02d/%02d/%02d ", fecha.day, fecha.month, fecha.yr);
                    sprintf(cadenaamostrar2, days_of_week[dia_de_la_semana(&fecha.day, &fecha.month, &fecha.yr)]);
                    haycambio = 0;
                } else {
                    sprintf(cadenaamostrar, "%02d/%02d/   ", fecha.day, fecha.month);
                    sprintf(cadenaamostrar2, cadena_esp);
                }
                bandera_graba_fecha = 1;
                break;
            }
            case MENU_CONFIGURAENCENDIDO:
            {

                if (flanco) {
                    sprintf(cadenaamostrar, "SET ENC  ");
                    sprintf(cadenaamostrar2, cadena_esp);
                }

                break;
            }
            case SUBMENU_CONFIGURAHORAENCENDIDO:
            {
                modificafecha = HORA;
                horario = &horarioenc;
                if (flanco || haycambio) {
                    sprintf(cadenaamostrar, "%02d:%02d    ", horarioenc.hrs, horarioenc.min);
                    sprintf(cadenaamostrar2, cadena_esp);
                    haycambio = 0;
                } else {
                    sprintf(cadenaamostrar, "  :%02d    ", horarioenc.min);
                    sprintf(cadenaamostrar2, cadena_esp);
                }
                bandera_graba_hora = 1;
                break;
            }
            case SUBMENU_CONFIGURAMINUTOSENCENDIDO:
            {
                modificafecha = MINUTOS;
                horario = &horarioenc;
                if (flanco || haycambio) {
                    sprintf(cadenaamostrar, "%02d:%02d    ", horarioenc.hrs, horarioenc.min);
                    sprintf(cadenaamostrar2, cadena_esp);
                    haycambio = 0;
                } else {
                    sprintf(cadenaamostrar, "%02d:      ", horarioenc.hrs);
                    sprintf(cadenaamostrar2, cadena_esp);
                }
                bandera_graba_hora = 1;
                break;
            }


            case SUBMENU_CONFIGURAPERIODOENCENDIDO:
            {
                modificafecha = PERIODOENCENDIDO;

                if (flanco || haycambio) {
                    sprintf(cadenaamostrar, "c/%u dias", periodoencendido);
                    sprintf(cadenaamostrar2, cadena_esp);
                    haycambio = 0;
                } else {
                    sprintf(cadenaamostrar, "c/  dias");
                    sprintf(cadenaamostrar2, cadena_esp);
                }
                bandera_graba_periodoencendido = 1;
                break;
            }

            case SUBMENU_CONFIGURATIEMPOENCENDIDO:
            {
                modificafecha = TIEMPOENCENDIDO;

                if (flanco || haycambio) {
                    sprintf(cadenaamostrar, "ENCEN:%02d", tiempoencendido);
                    sprintf(cadenaamostrar2, cadena_esp);
                    haycambio = 0;
                } else {
                    sprintf(cadenaamostrar, "ENCEN:  ");
                    sprintf(cadenaamostrar2, cadena_esp);
                }
                bandera_graba_tiempoencendido = 1;
                break;
            }
            case MENU_CONFIGURAFALLACORRIENTE:
            {
                modificafecha = SINO;
                banderasino=&usa_falla_de_corriente;
                if (flanco)
                    if (usa_falla_de_corriente) {
                        sprintf(cadenaamostrar, "FC:   SI");
                        sprintf(cadenaamostrar2, cadena_esp);
                    } else {
                        sprintf(cadenaamostrar, "FC:   NO");
                        sprintf(cadenaamostrar2, cadena_esp);
                    } else {
                    sprintf(cadenaamostrar, "FC:     ");
                    sprintf(cadenaamostrar2, cadena_esp);
                }
                bandera_graba_usa_falla_de_corriente = 1;
                break;
            }
            case MENU_CONFIGURATIEMPOFALLACORRIENTE:
            {
                modificafecha = TIEMPOFALLA;

                if (flanco || haycambio) {
                    sprintf(cadenaamostrar, "TFC:  %02d", tiempofalla);
                    sprintf(cadenaamostrar2, cadena_esp);
                    haycambio = 0;
                } else {
                    sprintf(cadenaamostrar, "TFC:    ");
                    sprintf(cadenaamostrar2, cadena_esp);
                }
                bandera_graba_tiempofalla = 1;
                break;
            }
            case MENU_CONFIGURAINDICACIONDENIVEL:
            {
                modificafecha = SINO;
               banderasino=  &usa_nivel_bajo ;
                if (flanco)
                    if (usa_nivel_bajo) {
                        sprintf(cadenaamostrar, "NIVEL:SI");
                        sprintf(cadenaamostrar2, cadena_esp);
                    } else {
                        sprintf(cadenaamostrar, "NIVEL:NO");
                        sprintf(cadenaamostrar2, cadena_esp);
                    } else {
                    sprintf(cadenaamostrar, "NIVEL:  ");
                    sprintf(cadenaamostrar2, cadena_esp);
                }
                bandera_graba_usa_nivel_bajo = 1;
                break;
            }
            case MENU_MUESTRAMEDICIONES:
            {
                unsigned int adcenteroI;
                unsigned int adcdecimalI;
                unsigned int adcenteroV;
                mediciondecorriente = (float) medidaI_adc * 50 / 1024;
                //convierto el valor decimal a float
                //para una entrada de 3.3V la lectura es 1023
                //para 0 V la lectura es 0
                //para una maxima lectura quiero que en el display se observe 50A
                //Deseo que tambien me muestre 1 decimal, separo la parte entera y la decimal
                //como la resolucion es 1024, cada bit corresponde a 50A/1024=0.048828125A
                //cada 20 muestras tengo aproximdamente 1A
                float mediciondevoltaje = (float) medidaV_adc * 440 / 1024;
                adcenteroI = (unsigned int) mediciondecorriente;
                adcdecimalI = (unsigned int) ((mediciondecorriente - (unsigned int) mediciondecorriente)*10);
                adcenteroV = (unsigned int) mediciondevoltaje;
                sprintf(cadenaamostrar, "%2u.%uA   ", (unsigned int) adcenteroI, (unsigned int) adcdecimalI);
                sprintf(cadenaamostrar2, "%3uV    ", (unsigned int) adcenteroV);
                break;
            }
            default:
                break;
        };
        //////////////////////////////////////////////////////////
        //Finaliza Procesa los menú
        // </editor-fold>

