pblfrnndmnr/control-bomba-isl1208-pic16-xc8/trunk/Control_BOMBA_RTC_ISL1208_V6.X/main.c
        // <editor-fold defaultstate="collapsed" desc="Verifica estados de falla">
        //Verifica estados de falla
        /////////////////////////////////////////////////////////
        if (menuactual != MENU_MUESTRAMEDICIONES && menuactual != MENU_MUESTRAFECHA && (menuactual < SUBMENU_CONFIGURADIA || menuactual > SUBMENU_CONFIGURAANIO)) {
            switch (estadobomba) {
                case BOMBAAPAGADA:
                {
                    sprintf(cadenaamostrar2, "     off");
                    break;
                }
                case BOMBAENCENDIDA:
                {
                    sprintf(cadenaamostrar2, "      on");
                    break;
                }
                default:
                    break;
            }
            switch (manual_automatico) {
                case MANUAL:
                {
                    strncpy(cadenaamostrar2, "MAN:", 4);
                    break;
                }
                case AUTOMATICO:
                {
                    strncpy(cadenaamostrar2, "AUT:", 4);
                    break;
                }
                default:
                    break;
            }
        }
        if ((estadonivel == NIVELNORMAL) && (estadofallacorriente == CORRIENTENORMAL) && (estadofallavoltaje == VOLTAJENORMAL)) {
            activabomba = ENCIENDEBOMBA;
            //TODO acá debo dar la orden para encender la bomba?
        } else {
            activabomba = APAGABOMBA;
        }

        switch (estadonivel) {
            case NIVELNORMAL:
            {

                break;
            }
            case NIVELBAJO:
            {
                activabomba = 0;
                break;
            }
            default:
                break;
        }

        switch (estadofallacorriente) {
            case CORRIENTENORMAL:
            {
                break;
            }
            case FALLACORRIENTE:
            {
                activabomba = 0;
                break;
            }
            default:
                break;
        }
        switch (estadofallavoltaje) {
            case VOLTAJENORMAL:
            {
                break;
            }
            case FALLAVOLTAJE:
            {
                activabomba = 0;
                break;
            }
            default:
                break;
        }
        //////////////////////////////////////////////////////
        //Fin Verifica estados de falla
        // </editor-fold>

        // <editor-fold defaultstate="collapsed" desc="Inicio de procesamiento de medicion de voltaje, corriente">


        //Inicio de procesamiento de medicion de voltaje, corriente
        /////////////////////////////////////////////////////////////
        //  unsigned int adcenteroI;
        //unsigned int adcdecimalI;
        unsigned int adcenteroV;

        //convierto el valor decimal a float
        //para una entrada de 3.3V la lectura es 1023
        //para 0 V la lectura es 0
        //para una maxima lectura quiero que en el display se observe 50A
        //Deseo que tambien me muestre 1 decimal, separo la parte entera y la decimal
        //como la resolucion es 1024, cada bit corresponde a 50A/1024=0.048828125A
        //cada 20 muestras tengo aproximdamente 1A
        float mediciondevoltaje = (float) medidaV_adc * 440 / 1024;
        adcenteroV = (unsigned int) mediciondevoltaje;
        //Se lee el voltaje de alimentación constantemente
        if (adcenteroV <= VOLTAJEMAXIMO && adcenteroV >= VOLTAJEMINIMO) {
            estadofallavoltaje = VOLTAJENORMAL;
        } else {
            estadofallavoltaje = FALLAVOLTAJE;
        }

        //Se lee la corriente consumida solamente cuando la bomba está activada
        switch (activabomba) {
            case APAGABOMBA:
            {
                break;
            }
            case ENCIENDEBOMBA:
            {
                mediciondecorriente = (float) medidaI_adc * 50 / 1024;
                //adcenteroI = (unsigned int) mediciondecorriente;
                //adcdecimalI = (unsigned int) ((mediciondecorriente - (unsigned int) mediciondecorriente)*10);
                if (mediciondecorriente <= CORRIENTEMAXIMA && mediciondecorriente >= CORRIENTEMINIMA) {
                    estadofallacorriente = CORRIENTENORMAL;
                    estadonivel = NIVELNORMAL;

                } else {
                    estadofallacorriente = FALLACORRIENTE;
                    estadonivel = NIVELBAJO;

                }
                break;
            }
            default:
                break;
        }

        /////////////////////////////////////////////////////////////
        //Fin de procesamiento de medicion de voltaje, corriente
        // </editor-fold>

        // <editor-fold defaultstate="collapsed" desc="Activa o desactiva la Bomba">
        //Activa o desactiva la Bomba
        ///////////////////////////////////////////////////////
        switch (activabomba) {
            case ENCIENDEBOMBA:
            {
                salidabomba = 1;
                estadobomba = 1;
                break;
            }
            case APAGABOMBA:
            {
                salidabomba = 0;
                estadobomba = 0;
                break;
            }
            default:
                break;
        }
        //////////////////////////////////////////////////////
        //Fin Activa o desactiva la Bomba
        // </editor-fold>

        // <editor-fold defaultstate="collapsed" desc="Procesa Alarma">
        //Inicio Procesa Alarma
        ///////////////////////////////////////////////////////
        switch (alarma_encendido) {
            case NOALARMA:
            {
                break;
            }
            case SIALARMA:
            {
                activabomba = ENCIENDEBOMBA;
                buzzer_on();
                alarma_encendido = NOALARMA;
                isl1208SR.Valor = ISL1208_Read_status();
                isl1208SR.ALM = 0; //reseteo la indicacion de alarma del RTC
                ISL1208_Set_status(&isl1208SR.Valor);
                break;
            }
            default:
                break;
        }
        //////////////////////////////////////////////////////
        //Fin Procesa Alarma
        // </editor-fold>

        // <editor-fold defaultstate="collapsed" desc="Actualiza Display">
        //Actualiza Display
        /////////////////////////////////////////////
        if (refrescadisplay) {
            vGotoxyLCD(1, 1);
            cadena = cadenaamostrar;
            while (*cadena != '\0')
                vLCD_Putc(*cadena++);
            vGotoxyLCD(1, 2);
            cadena = cadenaamostrar2;
            while (*cadena != '\0')
                vLCD_Putc(*cadena++);

